The selected faces contain both upward and downward pointing faces. Only the upward pointing faces were used.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId OnlyUpwardFacesUsed { get; }
  Visual Basic
Public Shared ReadOnly Property OnlyUpwardFacesUsed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ OnlyUpwardFacesUsed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoofFailures Class
  Autodesk.Revit.DB Namespace